/*Файзуллина Дарина Ирековна ПИ 1-1*/

#include<stdio.h>
int main(void)
{
    printf("==============================================\n");
    printf("\tЛАБОРАТОРНАЯ РАБОТА № 1\n");
    printf("==============================================\n");
    printf("Дисциплина: Алгоритмизация и программирование\n");
    printf("Язык:\tC\n");
    printf("Тема:\tПервая программа\n");
    printf("-----------------------------\n");
    printf("Элемент\tНазначение\n");
    printf("#include\tПодключение библиотеки\n");
    printf("main\t\tНачало выполнения\n");
    printf("printf\tВывод текста\n");
    printf("return 0\tУспешное завершеение\n");
    printf("-----------------------------\n");
    printf("Статус: программа выполнена успешно\n");
    printf("==============================================\n");
return 0;
}
